app/views/posts/_post.html.erb

SELECT COUNT(*) FROM `steps` WHERE `steps`.`post_id` = 1
---
	<div class="details">
		<span class="steps"> <%= post.steps.count %> </span>