app/controllers/posts_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
  def index
    @user = User.find(session[:user_id])

INSERT INTO `posts` (`created_at`, `description`, `title`, `updated_at`, `user_id`) VALUES ('2012-02-13 01:54:17', NULL, 'Mi primer post', '2012-02-13 01:54:17', NULL)
---
  def create
    params[:post][:user_id]=session[:user_id]
    @post = Post.new(params[:post])
    respond_to do |format|
      if @post.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 4 AND `posts`.`id` = 2 LIMIT 1
---
  def edit
    #params[:post][:user_id]=session[:user_id] || @current_user.id
    @user= User.find(session[:user_id])
    @post = @user.posts.find(params[:id])

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `title` = 'Mi primer post 2', `updated_at` = '2012-02-13 02:12:48' WHERE `posts`.`id` = 1
---
  def update
    params[:post][:user_id]=session[:user_id]
    @post = Post.find(params[:id])
    respond_to do |format|
      if @post.update_attributes(params[:post])