app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'highercomve' LIMIT 1
---
  def new
    user=User.find_by_username(params[:username]) || User.find_by_email(params[:username])

SELECT `users`.* FROM `users` WHERE `users`.`provider` = 'facebook' AND `users`.`uid` = '526599327' LIMIT 1
INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `provider`, `status`, `uid`, `updated_at`, `username`) VALUES ('2012-02-12 04:58:26', 'higher.vnf@gmail.com', 'SergioMarin', '$2a$10$6hdg2QKywa.Nh0yk4UADju1bqar8oSi2H7jGaRVyw9kD8LoQI/pcS', 'facebook', NULL, '526599327', '2012-02-12 04:58:26', 'higher.sam')
---
  def auth
    auth_hash = request.env['omniauth.auth']
    @authorization = User.find_by_provider_and_uid(auth_hash["provider"], auth_hash["uid"]) #|| User.find_by_email(auth_hash['info']['email'])
    respond_to do |format|
      if @authorization
        session[:user_id] = @authorization.id
        format.html { redirect_to :controller => 'users', :action => 'timeline' }
      else
          @user=User.create_with_omniauth(auth_hash)