app/controllers/steps_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @step = @post.steps.create(params[:step]).valid?
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
INSERT INTO `steps` (`content`, `created_at`, `post_id`, `title`, `updated_at`) VALUES ('prueba del primer paso.', '2012-02-13 03:37:48', 1, 'primer paso', '2012-02-13 03:37:48')

  def destroy
    @post = Post.find(params[:post_id])
    @step = @post.steps.find(params[:id])
    @step.destroy
---
SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
SELECT `steps`.* FROM `steps` WHERE `steps`.`post_id` = 1 AND `steps`.`id` = 10 LIMIT 1
DELETE FROM `steps` WHERE `steps`.`id` = 9