app/controllers/user_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "first_name", "last_name", "updated_at", "user_name") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 08 Feb 2012 17:39:01 UTC +00:00], ["email", nil], ["first_name", nil], ["last_name", nil], ["updated_at", Wed, 08 Feb 2012 17:39:01 UTC +00:00], ["user_name", nil]]