app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `name`, `password_digest`, `provider`, `status`, `uid`, `updated_at`, `username`) VALUES ('2012-02-14 21:41:46', 'higher.vnf@gmail.com', 'Sergio Marin', '$2a$10$w3MgbB2VzL9R9E914RFJoOlcCvfI65j0NpMlDD3QmBnBBNrG6V23O', NULL, NULL, NULL, '2012-02-14 21:41:46', 'highercomve')